{"_type":"staffMember","_id":"staff-member-soleil-heaney","name":"Soleil Heaney","slug":{"_type":"slug","current":"soleil-heaney"},"memberType":"director","role":{"en":"Executive Director","fr":"Directrice executive"},"bio":{"en":"Joining the Quadball Canada volunteer team in 2020 as an Events Coordinator, Soleil was critical in ensuring the safe return to in-person play following the COVID-19 lockdowns. In 2022, she took on the Events Director portfolio, and oversaw the return of our National Championship, which was held in Edmonton, AB. Working with local, provincial, and national sports organizations, Soleil engaged heavily in partnership building, policy work, and organizational development. She has had broad exposure to the Canadian sport context as a consultant, with extensive experience elevating and strengthening the governance frameworks of sports organizations in Canada. Soleil brings fresh perspective and vision to this critical leadership role, and is committed to building membership and engagement within our organization.","fr":"Rejoignant l'equipe benevole de Quadball Canada en 2020 en tant que coordonnatrice d'evenements, Soleil a ete essentielle pour assurer le retour securitaire au jeu en personne apres les confinements de la COVID-19. En 2022, elle a pris en charge le portefeuille de directrice des evenements et a supervise le retour de notre championnat national, qui s'est tenu a Edmonton, AB. Travaillant avec des organisations sportives locales, provinciales et nationales, Soleil s'est fortement engagee dans le developpement de partenariats, le travail de politique et le developpement organisationnel. Elle apporte une perspective et une vision nouvelles a ce role de leadership critique, et s'engage a developper l'adhesion et l'engagement au sein de notre organisation."},"orderRank":1}
{"_type":"staffMember","_id":"staff-member-alex-downey-ging","name":"Alex Downey-Ging","slug":{"_type":"slug","current":"alex-downey-ging"},"memberType":"director","role":{"en":"Membership Director","fr":"Directrice de l'adhesion"},"bio":{"en":"Alex joined the quadball community in 2010 as a player for Carleton Quidditch, and was Co-Captain of Ryerson Quidditch from 2012-2015. Since then she has organized many tournaments for the league, including as Tournament Director for Eastern Regionals and the National Championships, and stepped in as Events Director from 2020-2022. Previously she worked to promote the sport as Convention Coordinator from 2015-2019. She holds a Bachelor of Technology from Toronto Metropolitan University.","fr":"Alex a rejoint la communaute du quadball en 2010 en tant que joueuse pour Carleton Quidditch, et a ete co-capitaine de Ryerson Quidditch de 2012 a 2015. Depuis, elle a organise de nombreux tournois pour la ligue, notamment en tant que directrice de tournoi pour les championnats regionaux de l'Est et les championnats nationaux, et a assume le role de directrice des evenements de 2020 a 2022. Auparavant, elle a travaille a la promotion du sport en tant que coordonnatrice des congres de 2015 a 2019. Elle est titulaire d'un baccalaureat en technologie de l'Universite metropolitaine de Toronto."},"orderRank":2}
{"_type":"staffMember","_id":"staff-member-savannah-campbell","name":"Savannah Campbell","slug":{"_type":"slug","current":"savannah-campbell"},"memberType":"director","role":{"en":"Director of Marketing and Communications","fr":"Directrice du marketing et des communications"},"orderRank":3}
{"_type":"staffMember","_id":"staff-member-kyle-ross","name":"Kyle Ross","slug":{"_type":"slug","current":"kyle-ross"},"memberType":"director","role":{"en":"Gameplay Director","fr":"Directeur du gameplay"},"orderRank":4}
{"_type":"staffMember","_id":"staff-member-pearse-mckinney","name":"Pearse McKinney","slug":{"_type":"slug","current":"pearse-mckinney"},"memberType":"director","role":{"en":"Director of Finance","fr":"Directeur des finances"},"orderRank":5}
{"_type":"staffMember","_id":"staff-member-katie-doyle","name":"Katie Doyle","slug":{"_type":"slug","current":"katie-doyle"},"memberType":"director","role":{"en":"Western Events Director","fr":"Directrice des evenements de l'Ouest"},"bio":{"en":"Katie joined quadball in 2017 with the UVic Valkyries Quidditch Club. Since then she has served as treasurer for UVic's team as well as attempted to make a South Island Community team a possibility. She has been primarily reffing in the western quadball community in the past few years and was the non-playing tournament director for 2023 Western Regionals. She also joined Team Canada at 2023 World Cup as a non-playing volunteer and referee. Currently Katie is working as a financial planning assistant and office manager and is excited to put these and her other skills to use to bring some great events to fruition.","fr":"Katie a rejoint le quadball en 2017 avec le UVic Valkyries Quidditch Club. Depuis, elle a ete tresoriere de l'equipe UVic et a tente de rendre possible une equipe communautaire de South Island. Elle a principalement arbitre dans la communaute de quadball de l'Ouest au cours des dernieres annees et a ete directrice de tournoi sans jouer pour les championnats regionaux de l'Ouest 2023. Elle a egalement rejoint Equipe Canada a la Coupe du monde 2023 en tant que benevole et arbitre sans jouer. Actuellement, Katie travaille comme assistante en planification financiere et gestionnaire de bureau et est ravie de mettre ces competences et d'autres au service de la realisation d'excellents evenements."},"orderRank":6}
{"_type":"staffMember","_id":"staff-member-atishya-mani","name":"Atishya Mani","slug":{"_type":"slug","current":"atishya-mani"},"memberType":"director","role":{"en":"Eastern Events Director","fr":"Directrice des evenements de l'Est"},"bio":{"en":"Atishya joined the quadball community in 2022 as a player for the University of Toronto Centaurs, and now serves as president for the team. She has over 4 years of event management experience through her work in student council at her high school, as well as through house council at her residence. Currently she is a third year undergraduate student at the University of Toronto and is studying genetics, immunology and english. She is excited to use her experiences to help better Quadball Canada and learn more about sports management.","fr":"Atishya a rejoint la communaute du quadball en 2022 en tant que joueuse pour les Centaurs de l'Universite de Toronto, et sert maintenant de presidente pour l'equipe. Elle a plus de 4 ans d'experience en gestion d'evenements grace a son travail au conseil etudiant de son ecole secondaire, ainsi qu'au conseil de residence. Actuellement, elle est etudiante de troisieme annee a l'Universite de Toronto et etudie la genetique, l'immunologie et l'anglais. Elle est enthousiaste a l'idee d'utiliser ses experiences pour ameliorer Quadball Canada et en apprendre davantage sur la gestion sportive."},"orderRank":7}
{"_type":"staffMember","_id":"staff-member-michelle-ferguson","name":"Michelle Ferguson","slug":{"_type":"slug","current":"michelle-ferguson"},"memberType":"director","role":{"en":"National Team Program Director","fr":"Directrice du programme d'equipe nationale"},"orderRank":8}
{"_type":"staffMember","_id":"staff-member-joseph-verschuuren","name":"Joseph Verschuuren","slug":{"_type":"slug","current":"joseph-verschuuren"},"memberType":"coordinator","role":{"en":"Livestream Coordinator","fr":"Coordonnateur de diffusion en direct"},"bio":{"en":"Joseph joined the quadball community through the Fleming College team, and since then has held various roles, including Snitch Coordinator, Convention Coordinator, Event Coordinator, and Photographer. He has been happy to build and support our community, reflecting his passion for the sport and dedication to fostering a vibrant environment for all players.","fr":"Joseph a rejoint la communaute du quadball grace a l'equipe du Fleming College, et depuis lors, il a occupe divers roles, notamment coordonnateur des vifs d'or, coordonnateur des conventions, coordonnateur d'evenements et photographe. Il est heureux de batir et de soutenir notre communaute, refletant sa passion pour le sport et son devouement a favoriser un environnement dynamique pour tous les joueurs."},"reportsTo":{"_type":"reference","_ref":"staff-member-alex-downey-ging"},"orderRank":1}
{"_type":"staffMember","_id":"staff-member-arjun-patel","name":"Arjun Patel","slug":{"_type":"slug","current":"arjun-patel"},"memberType":"coordinator","role":{"en":"Safety Consultant","fr":"Consultant en securite"},"bio":{"en":"Arjun joined the quadball community in 2012, playing for UofT Scarborough. Since then, he has been a part of many community teams and the national team. Arjun is a physiotherapist and the director of Blue Space Clinic Physiotherapy and has a special interest in orthopedic, neuro, and sports injuries and serves in a consulting capacity with Quadball Canada. He is also an adjunct lecturer with the department of medicine at University of Toronto.","fr":"Arjun a rejoint la communaute du quadball en 2012, jouant pour UofT Scarborough. Depuis lors, il a fait partie de nombreuses equipes communautaires et de l'equipe nationale. Arjun est physiotherapeute et directeur de la clinique de physiotherapie Blue Space et s'interesse particulierement aux blessures orthopediques, neurologiques et sportives et agit a titre de consultant aupres de Quadball Canada. Il est egalement charge de cours auxiliaire au departement de medecine de l'Universite de Toronto."},"reportsTo":{"_type":"reference","_ref":"staff-member-alex-downey-ging"},"orderRank":2}
{"_type":"staffMember","_id":"staff-member-nathan-reid","name":"Nathan Reid","slug":{"_type":"slug","current":"nathan-reid"},"memberType":"coordinator","role":{"en":"League Nutrition Specialist","fr":"Specialiste en nutrition de la ligue"},"bio":{"en":"Nathan is a recent graduate of the University of Guelph's Master of Applied Nutrition (MAN) program, now launching his career as a Registered Dietitian specializing in sports nutrition. With nearly a decade in quadball, beginning with Queen's Quidditch Club in 2015, he has competed with multiple teams, including the Ottawa Otters, Mississauga Manatees, Carleton Ravens, and Guelph Gryphons Quadball. Currently, Nathan serves as League Nutrition Specialist for Quadball Canada, providing essential nutrition and hydration guidance to support athletes' performance and well-being. Through his private practice, he also offers 1-on-1 consultations for athletes seeking personalized nutrition plans tailored to their unique needs and goals. Nathan aims to help athletes reach their peak performance with practical, evidence-based nutrition strategies.","fr":"Nathan est un recent diplome du programme de maitrise en nutrition appliquee (MAN) de l'Universite de Guelph, lancant maintenant sa carriere en tant que dieteticien professionnel specialise en nutrition sportive. Avec pres d'une decennie dans le quadball, ayant commence avec le Queen's Quidditch Club en 2015, il a concouru avec plusieurs equipes, notamment les Ottawa Otters, Mississauga Manatees, Carleton Ravens et Guelph Gryphons Quadball. Actuellement, Nathan est specialiste en nutrition de la ligue pour Quadball Canada, fournissant des conseils essentiels en nutrition et en hydratation pour soutenir la performance et le bien-etre des athletes. Grace a sa pratique privee, il offre egalement des consultations individuelles pour les athletes recherchant des plans de nutrition personnalises adaptes a leurs besoins et objectifs uniques."},"reportsTo":{"_type":"reference","_ref":"staff-member-alex-downey-ging"},"orderRank":3}
{"_type":"staffMember","_id":"staff-member-carolyn-gao","name":"Carolyn Gao","slug":{"_type":"slug","current":"carolyn-gao"},"memberType":"coordinator","role":{"en":"Social Media Coordinator","fr":"Coordonnatrice des medias sociaux"},"bio":{"en":"Carolyn first encountered the Quadball community in 2015 while running on a track, when she heard someone shout, 'Watch out for that Bludger!' Six years later, in 2021, she joined the University of Toronto Centaurs and has been playing for the team ever since. A versatile athlete on the pitch, she has played as a Chaser, Beater, and Seeker, and she currently serves as the team's Assistant Captain and Speaking Captain. Off the field, she is an undergraduate student at the University of Toronto, pursuing a Bachelor of Arts with a double major in Political Science and Philosophy.","fr":"Carolyn a decouvert la communaute Quadball pour la premiere fois en 2015 alors qu'elle courait sur une piste, lorsqu'elle a entendu quelqu'un crier : 'Attention a ce Cognard!' Six ans plus tard, en 2021, elle a rejoint les Centaurs de l'Universite de Toronto et joue pour l'equipe depuis. Athlete polyvalente sur le terrain, elle a joue en tant que poursuiveuse, batteuse et attrapeur, et elle est actuellement capitaine adjointe et capitaine de parole de l'equipe. En dehors du terrain, elle est etudiante de premier cycle a l'Universite de Toronto, poursuivant un baccalaureat es arts avec une double majeure en science politique et philosophie."},"reportsTo":{"_type":"reference","_ref":"staff-member-savannah-campbell"},"orderRank":1}
{"_type":"staffMember","_id":"staff-member-grace-davey","name":"Grace Davey","slug":{"_type":"slug","current":"grace-davey"},"memberType":"coordinator","role":{"en":"Social Media Coordinator","fr":"Coordonnatrice des medias sociaux"},"bio":{"en":"Grace joined the quadball community in 2022 as a member of the Guelph Gryphons, and was also a member of the 2024 Team Canada development team, or 'bubble team'. Since joining quadball she has taken up roles as beater captain and vice president for Guelph as well as co-running Guelph's social media, including the Instagram, TikTok, and Facebook pages. She is currently double majoring in English and Creative writing at the University of Guelph.","fr":"Grace a rejoint la communaute du quadball en 2022 en tant que membre des Guelph Gryphons, et etait egalement membre de l'equipe de developpement d'Equipe Canada 2024, ou 'equipe bulle'. Depuis qu'elle a rejoint le quadball, elle a assume les roles de capitaine des batteurs et de vice-presidente pour Guelph, ainsi que la co-gestion des medias sociaux de Guelph, y compris les pages Instagram, TikTok et Facebook. Elle est actuellement en double majeure en anglais et en ecriture creative a l'Universite de Guelph."},"reportsTo":{"_type":"reference","_ref":"staff-member-savannah-campbell"},"orderRank":2}
{"_type":"staffMember","_id":"staff-member-micah-andaya","name":"Micah Andaya","slug":{"_type":"slug","current":"micah-andaya"},"memberType":"coordinator","role":{"en":"Social Media Coordinator","fr":"Coordonnateur des medias sociaux"},"reportsTo":{"_type":"reference","_ref":"staff-member-savannah-campbell"},"orderRank":3}
{"_type":"staffMember","_id":"staff-member-alexander-scherger","name":"Alexander Scherger","slug":{"_type":"slug","current":"alexander-scherger"},"memberType":"coordinator","role":{"en":"Referee Coordinator","fr":"Coordonnateur des arbitres"},"reportsTo":{"_type":"reference","_ref":"staff-member-kyle-ross"},"orderRank":1}
{"_type":"staffMember","_id":"staff-member-siri-beke","name":"Siri Beke","slug":{"_type":"slug","current":"siri-beke"},"memberType":"coordinator","role":{"en":"Gameplay Coordinator","fr":"Coordonnateur de gameplay"},"reportsTo":{"_type":"reference","_ref":"staff-member-kyle-ross"},"orderRank":2}
{"_type":"staffMember","_id":"staff-member-bryan-melchior","name":"Bryan Melchior","slug":{"_type":"slug","current":"bryan-melchior"},"memberType":"coordinator","role":{"en":"Gameplay Coordinator","fr":"Coordonnateur de gameplay"},"reportsTo":{"_type":"reference","_ref":"staff-member-kyle-ross"},"orderRank":3}
{"_type":"staffMember","_id":"staff-member-cayley-mendoza","name":"Cayley Mendoza","slug":{"_type":"slug","current":"cayley-mendoza"},"memberType":"coordinator","role":{"en":"Gameplay Coordinator","fr":"Coordonnatrice de gameplay"},"reportsTo":{"_type":"reference","_ref":"staff-member-kyle-ross"},"orderRank":4}
{"_type":"staffMember","_id":"staff-member-karen-naftel","name":"Karen Naftel","slug":{"_type":"slug","current":"karen-naftel"},"memberType":"coordinator","role":{"en":"Finance Coordinator","fr":"Coordonnatrice des finances"},"bio":{"en":"Karen Naftel joined the quadball community in 2014 with the University of Ottawa. She then went on to play for the Ottawa Otters and Team Canada. She served as treasurer for all of these teams. Karen works as a mechanical engineer where she loves solving problems and building spreadsheets.","fr":"Karen Naftel a rejoint la communaute du quadball en 2014 avec l'Universite d'Ottawa. Elle a ensuite joue pour les Ottawa Otters et Equipe Canada. Elle a ete tresoriere pour toutes ces equipes. Karen travaille comme ingenieure en mecanique ou elle aime resoudre des problemes et batir des feuilles de calcul."},"reportsTo":{"_type":"reference","_ref":"staff-member-pearse-mckinney"},"orderRank":1}
